KAVATER/STM32-BLE/STM_Client/STM32_WPAN/App/app_ble.c
	/* USER CODE BEGIN Header */
	/**
	  ******************************************************************************
	  * @file    App/app_ble.c
	  * @author  MCD Application Team
	  * @brief   BLE Application
	  ******************************************************************************
	  * @attention
	  *
	  * Copyright (c) 2026 STMicroelectronics.
	  * All rights reserved.
	  *
	  * This software is licensed under terms that can be found in the LICENSE file
	  * in the root directory of this software component.
	  * If no LICENSE file comes with this software, it is provided AS-IS.
	  *
	  ******************************************************************************
	  */
	/* USER CODE END Header */

	/* Includes ------------------------------------------------------------------*/
	#include "main.h"

	#include "app_common.h"

	#include "dbg_trace.h"

	#include "ble.h"
	#include "tl.h"
	#include "app_ble.h"

	#include "stm32_seq.h"
	#include "shci.h"
	#include "stm32_lpm.h"
	#include "otp.h"

	#include "p2p_client_app.h"

	/* Private includes ----------------------------------------------------------*/
	/* USER CODE BEGIN Includes */
        #define MAX_SEEN_DEVICES 5

	   uint8_t seen_devices[MAX_SEEN_DEVICES][6];  /* 10 devices, 6 bytes each */
	   uint8_t seen_count = 0;
	  uint8_t already_seen = 0;
	/* USER CODE END Includes */

	/* Private typedef -----------------------------------------------------------*/

	/**
	 * security parameters structure
	 */
	typedef struct _tSecurityParams
	{
	  /**
	   * IO capability of the device
	   */
	  uint8_t ioCapability;

	  /**
	   * Authentication requirement of the device
	   * Man In the Middle protection required?
	   */
	  uint8_t mitm_mode;

	  /**
	   * bonding mode of the device
	   */
	  uint8_t bonding_mode;

	  /**
	   * minimum encryption key size requirement
	   */
	  uint8_t encryptionKeySizeMin;

	  /**
	   * maximum encryption key size requirement
	   */
	  uint8_t encryptionKeySizeMax;

	  /**
	   * this flag indicates whether the host has to initiate
	   * the security, wait for pairing or does not have any security
	   * requirements.
	   * 0x00 : no security required
	   * 0x01 : host should initiate security by sending the slave security
	   *        request command
	   * 0x02 : host need not send the clave security request but it
	   * has to wait for paiirng to complete before doing any other
	   * processing
	   */
	  uint8_t initiateSecurity;
	} tSecurityParams;

	/**
	 * global context
	 * contains the variables common to all
	 * services
	 */
	typedef struct _tBLEProfileGlobalContext
	{
	  /**
	   * security requirements of the host
	   */
	  tSecurityParams bleSecurityParam;

	  /**
	   * gap service handle
	   */
	  uint16_t gapServiceHandle;

	  /**
	   * device name characteristic handle
	   */
	  uint16_t devNameCharHandle;

	  /**
	   * appearance characteristic handle
	   */
	  uint16_t appearanceCharHandle;

	  /**
	   * connection handle of the current active connection
	   * When not in connection, the handle is set to 0xFFFF
	   */
	  uint16_t connectionHandle;

	  /**
	   * length of the UUID list to be used while advertising
	   */
	  uint8_t advtServUUIDlen;

	  /**
	   * the UUID list to be used while advertising
	   */
	  uint8_t advtServUUID[100];
	} BleGlobalContext_t;

	typedef struct
	{
	  BleGlobalContext_t BleApplicationContext_legacy;
	  APP_BLE_ConnStatus_t Device_Connection_Status;
	  uint8_t SwitchOffGPIO_timer_Id;
	  uint8_t DeviceServerFound;
	} BleApplicationContext_t;

	#if OOB_DEMO != 0
	typedef struct
	{
	  uint8_t  Identifier;
	  uint16_t L2CAP_Length;
	  uint16_t Interval_Min;
	  uint16_t Interval_Max;
	  uint16_t Latency;
	  uint16_t Timeout_Multiplier;
	} APP_BLE_p2p_Conn_Update_req_t;
	#endif

	/* USER CODE BEGIN PTD */

	/* USER CODE END PTD */

	/* Private defines -----------------------------------------------------------*/
	#define APPBLE_GAP_DEVICE_NAME_LENGTH 7
	#define BD_ADDR_SIZE_LOCAL    6
	#define BLE_DEFAULT_PIN                     (111111)

	/* USER CODE BEGIN PD */

	/* USER CODE END PD */

	/* Private macros ------------------------------------------------------------*/
	/* USER CODE BEGIN PM */

	/* USER CODE END PM */

	/* Private variables ---------------------------------------------------------*/
	PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_CmdPacket_t BleCmdBuffer;

	static const uint8_t a_MBdAddr[BD_ADDR_SIZE_LOCAL] =
	{
	  (uint8_t)((CFG_ADV_BD_ADDRESS & 0x0000000000FF)),
	  (uint8_t)((CFG_ADV_BD_ADDRESS & 0x00000000FF00) >> 8),
	  (uint8_t)((CFG_ADV_BD_ADDRESS & 0x000000FF0000) >> 16),
	  (uint8_t)((CFG_ADV_BD_ADDRESS & 0x0000FF000000) >> 24),
	  (uint8_t)((CFG_ADV_BD_ADDRESS & 0x00FF00000000) >> 32),
	  (uint8_t)((CFG_ADV_BD_ADDRESS & 0xFF0000000000) >> 40)
	};

	static uint8_t a_BdAddrUdn[BD_ADDR_SIZE_LOCAL];
	/**
	*   Identity root key used to derive IRK and DHK(Legacy)
	*/
	static const uint8_t a_BLE_CfgIrValue[16] = CFG_BLE_IR;

	/**
	* Encryption root key used to derive LTK(Legacy) and CSRK
	*/
	static const uint8_t a_BLE_CfgErValue[16] = CFG_BLE_ER;

	tBDAddr SERVER_REMOTE_BDADDR;
	uint8_t SERVER_REMOTE_ADDR_TYPE;

	P2PC_APP_ConnHandle_Not_evt_t handleNotification;

	static BleApplicationContext_t BleApplicationContext;

	#if OOB_DEMO != 0
	APP_BLE_p2p_Conn_Update_req_t APP_BLE_p2p_Conn_Update_req;
	#endif

	/* USER CODE BEGIN PV */

	/* USER CODE END PV */

	/* Private function prototypes -----------------------------------------------*/
	static void BLE_UserEvtRx(void * pPayload);
	static void BLE_StatusNot(HCI_TL_CmdStatus_t status);
	static void Ble_Tl_Init(void);
	static void Ble_Hci_Gap_Gatt_Init(void);
	static const uint8_t* BleGetBdAddress(void);
	static void Scan_Request(void);
	static void Connect_Request(void);
	static void Switch_OFF_GPIO(void);

	/* USER CODE BEGIN PFP */

	/* USER CODE END PFP */

	/* External variables --------------------------------------------------------*/

	/* USER CODE BEGIN EV */

	/* USER CODE END EV */

	/* Functions Definition ------------------------------------------------------*/
	void APP_BLE_Init(void)
	{
	  SHCI_CmdStatus_t status;
	  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
	  /* USER CODE BEGIN APP_BLE_Init_1 */

	  /* USER CODE END APP_BLE_Init_1 */
	  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
	  {
		{{0,0,0}},                          /**< Header unused */
		{0,                                 /** pBleBufferAddress not used */
		 0,                                 /** BleBufferSize not used */
		 CFG_BLE_NUM_GATT_ATTRIBUTES,
		 CFG_BLE_NUM_GATT_SERVICES,
		 CFG_BLE_ATT_VALUE_ARRAY_SIZE,
		 CFG_BLE_NUM_LINK,
		 CFG_BLE_DATA_LENGTH_EXTENSION,
		 CFG_BLE_PREPARE_WRITE_LIST_SIZE,
		 CFG_BLE_MBLOCK_COUNT,
		 CFG_BLE_MAX_ATT_MTU,
		 CFG_BLE_PERIPHERAL_SCA,
		 CFG_BLE_CENTRAL_SCA,
		 CFG_BLE_LS_SOURCE,
		 CFG_BLE_MAX_CONN_EVENT_LENGTH,
		 CFG_BLE_HSE_STARTUP_TIME,
		 CFG_BLE_VITERBI_MODE,
		 CFG_BLE_OPTIONS,
		 0,
		 CFG_BLE_MAX_COC_INITIATOR_NBR,
		 CFG_BLE_MIN_TX_POWER,
		 CFG_BLE_MAX_TX_POWER,
		 CFG_BLE_RX_MODEL_CONFIG,
		 CFG_BLE_MAX_ADV_SET_NBR,
		 CFG_BLE_MAX_ADV_DATA_LEN,
		 CFG_BLE_TX_PATH_COMPENS,
		 CFG_BLE_RX_PATH_COMPENS,
		 CFG_BLE_CORE_VERSION,
		 CFG_BLE_OPTIONS_EXT,
		 CFG_BLE_MAX_ADD_EATT_BEARERS
		}
	  };

	  /**
	   * Initialize Ble Transport Layer
	   */
	  Ble_Tl_Init();

	  /**
	   * Do not allow standby in the application
	   */
	  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);

	  /**
	   * Register the hci transport layer to handle BLE User Asynchronous Events
	   */
	  UTIL_SEQ_RegTask(1<<CFG_TASK_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU, hci_user_evt_proc);

	  /**
	   * Starts the BLE Stack on CPU2
	   */
	  status = SHCI_C2_BLE_Init(&ble_init_cmd_packet);
	  if (status != SHCI_Success)
	  {
		APP_DBG_MSG("  Fail   : SHCI_C2_BLE_Init command, result: 0x%02x\n\r", status);
		/* if you are here, maybe CPU2 doesn't contain STM32WB_Copro_Wireless_Binaries, see Release_Notes.html */
		Error_Handler();
	  }
	  else
	  {
		APP_DBG_MSG("  Success: SHCI_C2_BLE_Init command\n\r");
	  }

	  /**
	   * Initialization of HCI & GATT & GAP layer
	   */
	  Ble_Hci_Gap_Gatt_Init();

	  /**
	   * Initialization of the BLE Services
	   */
	  SVCCTL_Init();

	  /**
	   * From here, all initialization are BLE application specific
	   */
	  UTIL_SEQ_RegTask(1<<CFG_TASK_START_SCAN_ID, UTIL_SEQ_RFU, Scan_Request);
	  UTIL_SEQ_RegTask(1<<CFG_TASK_CONN_DEV_1_ID, UTIL_SEQ_RFU, Connect_Request);

	  /**
	   * Initialization of the BLE App Context
	   */
	  BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;

