KAVATER/STM32-BLE/STM_Client/STM32_WPAN/App/app_ble.c
	  /*Radio mask Activity*/
	#if (OOB_DEMO != 0)
	  ret = aci_hal_set_radio_activity_mask(0x0020);
	  if (ret != BLE_STATUS_SUCCESS)
	  {
		APP_DBG_MSG("  Fail   : aci_hal_set_radio_activity_mask command, result: 0x%x \n\r", ret);
	  }
	  else
	  {
		APP_DBG_MSG("  Success: aci_hal_set_radio_activity_mask command\n\r");
	  }
	  APP_DBG_MSG("\n");
	#endif
	  /**
	   * Initialize P2P Client Application
	   */
	  P2PC_APP_Init();

	  /* USER CODE BEGIN APP_BLE_Init_3 */
	  /* Table to remember already-seen devices */

	  /* USER CODE END APP_BLE_Init_3 */

	#if (OOB_DEMO != 0)
	  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.SwitchOffGPIO_timer_Id), hw_ts_SingleShot, Switch_OFF_GPIO);
	#endif

	#if (OOB_DEMO == 0)
	  /**
	   * Start scanning
	   */
	  UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
	#endif
	  /* USER CODE BEGIN APP_BLE_Init_2 */

	  /* USER CODE END APP_BLE_Init_2 */
	  return;
	}

	SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *pckt)
	{
	  hci_event_pckt *event_pckt;
	  evt_le_meta_event *meta_evt;
	  hci_le_connection_complete_event_rp0 * connection_complete_event;
	  evt_blecore_aci *blecore_evt;
	  hci_le_advertising_report_event_rp0 * le_advertising_event;
	  event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) pckt)->data;
	  hci_disconnection_complete_event_rp0 *cc = (void *) event_pckt->data;
	  uint8_t result;
	  uint8_t event_type, event_data_size;
	  int k = 0;
	  uint8_t adtype, adlength;
	#if (OOB_DEMO != 0)
	  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
	#endif

	  switch (event_pckt->evt)
	  {
		/* USER CODE BEGIN evt */
		/* USER CODE END evt */
		case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
		  {
			handleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
			blecore_evt = (evt_blecore_aci*) event_pckt->data;
			/* USER CODE BEGIN EVT_VENDOR */

			/* USER CODE END EVT_VENDOR */
			switch (blecore_evt->ecode)
			{
			  /* USER CODE BEGIN ecode */

			  /* USER CODE END ecode */

			  case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
				{
				  /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE */

				  /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE */
				  aci_gap_proc_complete_event_rp0 *gap_evt_proc_complete = (void*) blecore_evt->data;
				  /* CHECK GAP GENERAL DISCOVERY PROCEDURE COMPLETED & SUCCEED */
				  if (gap_evt_proc_complete->Procedure_Code == GAP_GENERAL_DISCOVERY_PROC
					  && gap_evt_proc_complete->Status == 0x00)
				  {
					/* USER CODE BEGIN GAP_GENERAL_DISCOVERY_PROC */

					/* USER CODE END GAP_GENERAL_DISCOVERY_PROC */
					APP_DBG_MSG("-- GAP GENERAL DISCOVERY PROCEDURE_COMPLETED\n\r");
					/*if a device found, connect to it, device 1 being chosen first if both found*/
					if (BleApplicationContext.DeviceServerFound == 0x01 && BleApplicationContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
					{
					  UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_1_ID, CFG_SCH_PRIO_0);
					}
					 else
					       {
					            /*Rearming GAP to scan and listen to the available ble packets.*/
					                  UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
					       }
				  }
				}
				break;

	   #if (OOB_DEMO != 0)
			  case ACI_L2CAP_CONNECTION_UPDATE_REQ_VSEVT_CODE:
				{
				  /* USER CODE BEGIN EVT_BLUE_L2CAP_CONNECTION_UPDATE_REQ */

				  /* USER CODE END EVT_BLUE_L2CAP_CONNECTION_UPDATE_REQ */
				  aci_l2cap_connection_update_req_event_rp0 *pr = (aci_l2cap_connection_update_req_event_rp0 *) blecore_evt->data;
				  ret = aci_hal_set_radio_activity_mask(0x0000);
				  if (ret != BLE_STATUS_SUCCESS)
				  {
					APP_DBG_MSG("  Fail   : aci_hal_set_radio_activity_mask command, result: 0x%x \n\r", ret);
				  }
				  else
				  {
					APP_DBG_MSG("  Success: aci_hal_set_radio_activity_mask command\n\r");
				  }

				  APP_BLE_p2p_Conn_Update_req.Identifier = pr->Identifier;
				  APP_BLE_p2p_Conn_Update_req.L2CAP_Length = pr->L2CAP_Length;
				  APP_BLE_p2p_Conn_Update_req.Interval_Min = pr->Interval_Min;
				  APP_BLE_p2p_Conn_Update_req.Interval_Max = pr->Interval_Max;
				  APP_BLE_p2p_Conn_Update_req.Latency = pr->Latency;
				  APP_BLE_p2p_Conn_Update_req.Timeout_Multiplier = pr->Timeout_Multiplier;

				  ret = aci_l2cap_connection_parameter_update_resp(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
																   APP_BLE_p2p_Conn_Update_req.Interval_Min,
																   APP_BLE_p2p_Conn_Update_req.Interval_Max,
																   APP_BLE_p2p_Conn_Update_req.Latency,
																   APP_BLE_p2p_Conn_Update_req.Timeout_Multiplier,
																   CONN_L1,
																   CONN_L2,
																   APP_BLE_p2p_Conn_Update_req.Identifier,
																   0x01);
				  if(ret != BLE_STATUS_SUCCESS)
				  {
					APP_DBG_MSG("  Fail   : aci_l2cap_connection_parameter_update_resp command, result: 0x%x \n\r", ret);
					/* USER CODE BEGIN BLE_STATUS_SUCCESS */

					/* USER CODE END BLE_STATUS_SUCCESS */
				  }
				  else
				  {
					APP_DBG_MSG("  Success: aci_l2cap_connection_parameter_update_resp command\n\r");
				  }

				  ret = aci_hal_set_radio_activity_mask(0x0020);
				  if (ret != BLE_STATUS_SUCCESS)
				  {
					APP_DBG_MSG("  Fail   : aci_hal_set_radio_activity_mask command, result: 0x%x \n\r", ret);
				  }
				  else
				  {
					APP_DBG_MSG("  Success: aci_hal_set_radio_activity_mask command\n\r");
				  }
				}
				break;

			  case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
				{
				  /* USER CODE BEGIN RADIO_ACTIVITY_EVENT */

				  /* USER CODE END RADIO_ACTIVITY_EVENT */
				}
				break; /* ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE */
	  #endif

			  /* USER CODE BEGIN BLUE_EVT */

			  /* USER CODE END BLUE_EVT */

			  default:
				/* USER CODE BEGIN ecode_default */

				/* USER CODE END ecode_default */
				break;
			}
		  }
		  break;

		case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
		  {
			/* USER CODE BEGIN EVT_DISCONN_COMPLETE */

			/* USER CODE END EVT_DISCONN_COMPLETE */
			if (cc->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
			{
			  BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
			  BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
			  APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT WITH SERVER \n\r");
			  handleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
			  handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
			  P2PC_APP_Notification(&handleNotification);
			}
		  }
		  break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */

		case HCI_LE_META_EVT_CODE:
		  {
			/* USER CODE BEGIN EVT_LE_META_EVENT */

			/* USER CODE END EVT_LE_META_EVENT */
			meta_evt = (evt_le_meta_event*) event_pckt->data;

