KAVATER/STM32-BLE/STM_Client/STM32_WPAN/App/app_ble.c
			switch (meta_evt->subevent)
			{
			  /* USER CODE BEGIN subevent */

			  /* USER CODE END subevent */

			  case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
				/* USER CODE BEGIN EVT_LE_CONN_COMPLETE */

				/* USER CODE END EVT_LE_CONN_COMPLETE */
				/**
				 * The connection is done,
				 */
				connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
				BleApplicationContext.BleApplicationContext_legacy.connectionHandle = connection_complete_event->Connection_Handle;
				BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;

				/* CONNECTION WITH CLIENT */
				APP_DBG_MSG("\r\n\r**  CONNECTION COMPLETE EVENT WITH SERVER \n\r");
				handleNotification.P2P_Evt_Opcode = PEER_CONN_HANDLE_EVT;
				handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
				P2PC_APP_Notification(&handleNotification);

				result = aci_gatt_disc_all_primary_services(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
				if (result == BLE_STATUS_SUCCESS)
				{
				  APP_DBG_MSG("\r\n\r** GATT SERVICES & CHARACTERISTICS DISCOVERY  \n\r");
				  APP_DBG_MSG("* GATT :  Start Searching Primary Services \r\n\r");
				}
				else
				{
				  APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
				}
				break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

			  case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
				{
				  uint8_t *adv_report_data;
				  /* USER CODE BEGIN EVT_LE_ADVERTISING_REPORT */
				  char local_name[32] = {0};/*buffer to hold decoded device name*/

				  uint8_t name_len = 0;/* how many name bytes we actually got */



				  /* USER CODE END EVT_LE_ADVERTISING_REPORT */
				  le_advertising_event = (hci_le_advertising_report_event_rp0 *) meta_evt->data;

				  event_type = le_advertising_event->Advertising_Report[0].Event_Type;

				  event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;

				  /* WARNING: be careful when decoding advertising report as its raw format cannot be mapped on a C structure.
				  The data and RSSI values could not be directly decoded from the RAM using the data and RSSI field from hci_le_advertising_report_event_rp0 structure.
				  Instead they must be read by using offsets (please refer to BLE specification).
				  RSSI = (int8_t)*(uint8_t*) (adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data);
				  */
				  adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;
				  k = 0;

				  /* search AD TYPE 0x09 (Complete Local Name) */
				  /* search AD Type 0x02 (16 bits UUIDS) */
				  if ((event_type == ADV_IND) || (event_type == SCAN_RSP))
				  {
					/* ISOLATION OF BD ADDRESS AND LOCAL NAME */

					while(k < event_data_size)
					{
					  adlength = adv_report_data[k];
					  adtype = adv_report_data[k + 1];
					  switch (adtype)
					  {
						case AD_TYPE_FLAGS: /* now get flags */
						  /* USER CODE BEGIN AD_TYPE_FLAGS */

						  /* USER CODE END AD_TYPE_FLAGS */
						  break;

						case AD_TYPE_TX_POWER_LEVEL: /* Tx power level */
						  /* USER CODE BEGIN AD_TYPE_TX_POWER_LEVEL */

						  /* USER CODE END AD_TYPE_TX_POWER_LEVEL */
						  break;

						case AD_TYPE_MANUFACTURER_SPECIFIC_DATA: /* Manufacturer Specific */
						  /* USER CODE BEGIN AD_TYPE_MANUFACTURER_SPECIFIC_DATA */

						  /* USER CODE END AD_TYPE_MANUFACTURER_SPECIFIC_DATA */
						  if (adlength >= 7 && adv_report_data[k + 2] == 0x01)
						  { /* ST VERSION ID 01 */
							APP_DBG_MSG("--- ST MANUFACTURER ID --- \n\r");
							switch (adv_report_data[k + 3])
							{   /* Demo ID */
							   case CFG_DEV_ID_P2P_SERVER1: /* End Device 1 */
							   APP_DBG_MSG("-- SERVER DETECTED -- VIA MAN ID\n\r");
							   BleApplicationContext.DeviceServerFound = 0x01;
							   SERVER_REMOTE_ADDR_TYPE = le_advertising_event->Advertising_Report[0].Address_Type;
							   SERVER_REMOTE_BDADDR[0] = le_advertising_event->Advertising_Report[0].Address[0];
							   SERVER_REMOTE_BDADDR[1] = le_advertising_event->Advertising_Report[0].Address[1];
							   SERVER_REMOTE_BDADDR[2] = le_advertising_event->Advertising_Report[0].Address[2];
							   SERVER_REMOTE_BDADDR[3] = le_advertising_event->Advertising_Report[0].Address[3];
							   SERVER_REMOTE_BDADDR[4] = le_advertising_event->Advertising_Report[0].Address[4];
							   SERVER_REMOTE_BDADDR[5] = le_advertising_event->Advertising_Report[0].Address[5];
							   break;

							  default:
								break;
							}
						  }
						  break;

						case AD_TYPE_SERVICE_DATA: /* service data 16 bits */
						  /* USER CODE BEGIN AD_TYPE_SERVICE_DATA */

						  /* USER CODE END AD_TYPE_SERVICE_DATA */
						  break;

					   // default:

						  /* USER CODE BEGIN adtype_default */
						  //remove the above default statement
						case AD_TYPE_COMPLETE_LOCAL_NAME:
						case AD_TYPE_SHORTENED_LOCAL_NAME:
						name_len = adlength -1;
						if(name_len > sizeof(local_name)-1)
							name_len = sizeof(local_name)-1; /*new overflow buffer*/
						memcpy(local_name, &adv_report_data[k+2],name_len);
						local_name[name_len] = '\0';
						break;

						default:
						  /* USER CODE END adtype_default */
						  break;
					  } /* end switch adtype */
					  k += adlength + 1;
					} /* end while */
				  } /* end if ADV_IND */

				  /* USER CODE BEGIN EVT_LE_ADVERTISING_REPORT_2 */


				  /* Check if we've seen this address before */
				  already_seen = 0;
				  for (uint8_t i = 0; i < seen_count; i++)
				  {
				      if (memcmp(seen_devices[i],
				                 le_advertising_event->Advertising_Report[0].Address, 6) == 0)
				      {
				          already_seen = 1;
				          break;
				      }
				  }
				  /* Only print if it's new and strength is smaller than -80*/
				  if (!already_seen && seen_count < MAX_SEEN_DEVICES && (-80 <= (int8_t)*(uint8_t*)(adv_report_data + event_data_size)))
				  {
				      /* Remember this device */
				      memcpy(seen_devices[seen_count],
				             le_advertising_event->Advertising_Report[0].Address, 6);
				      seen_count++;

				      /* Now print */
				      printf("%02X:%02X:%02X:%02X:%02X:%02X | RSSI %4d dBm | %s\r\n",
				      							 le_advertising_event->Advertising_Report[0].Address[5],
				      							 le_advertising_event->Advertising_Report[0].Address[4],
				      							 le_advertising_event->Advertising_Report[0].Address[3],
				      							 le_advertising_event->Advertising_Report[0].Address[2],
				      							 le_advertising_event->Advertising_Report[0].Address[1],
				      							 le_advertising_event->Advertising_Report[0].Address[0],
				      							 (int8_t)*(uint8_t*)(adv_report_data + event_data_size),
				      							 (name_len ? local_name : "(No Name)"));
				                 }
				  /* USER CODE END EVT_LE_ADVERTISING_REPORT_2 */
				}
				break;

			  /* USER CODE BEGIN META_EVT */

			  /* USER CODE END META_EVT */

			  default:
				/* USER CODE BEGIN subevent_default */

