KAVATER/STM32-BLE/STM_Client/STM32_WPAN/App/app_ble.c
				/* USER CODE END subevent_default */
				break;
			}
		  }
		  break; /* HCI_LE_META_EVT_CODE */

		/* USER CODE BEGIN EVENT_PCKT */

		/* USER CODE END EVENT_PCKT */

		default:
		  /* USER CODE BEGIN evt_default */

		  /* USER CODE END evt_default */
		  break;
	  }

	  return (SVCCTL_UserEvtFlowEnable);
	}

	APP_BLE_ConnStatus_t APP_BLE_Get_Client_Connection_Status(uint16_t Connection_Handle)
	{
	  if (BleApplicationContext.BleApplicationContext_legacy.connectionHandle == Connection_Handle)
	  {
		return BleApplicationContext.Device_Connection_Status;
	  }
	  return APP_BLE_IDLE;
	}
	/* USER CODE BEGIN FD */

	/* USER CODE END FD */
	/*************************************************************
	 *
	 * LOCAL FUNCTIONS
	 *
	 *************************************************************/
	static void Ble_Tl_Init(void)
	{
	  HCI_TL_HciInitConf_t Hci_Tl_Init_Conf;

	  Hci_Tl_Init_Conf.p_cmdbuffer = (uint8_t*)&BleCmdBuffer;
	  Hci_Tl_Init_Conf.StatusNotCallBack = BLE_StatusNot;
	  hci_init(BLE_UserEvtRx, (void*) &Hci_Tl_Init_Conf);

	  return;
	}

	static void Ble_Hci_Gap_Gatt_Init(void)
	{
	  uint8_t role;
	  uint16_t gap_service_handle, gap_dev_name_char_handle, gap_appearance_char_handle;
	  const uint8_t *p_bd_addr;

	  uint16_t a_appearance[1] = { BLE_CFG_GAP_APPEARANCE };
	  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

	  APP_DBG_MSG("==>> Start Ble_Hci_Gap_Gatt_Init function\n");

	  /**
	   * Initialize HCI layer
	   */
	  /*HCI Reset to synchronise BLE Stack*/
	  ret = hci_reset();
	  if (ret != BLE_STATUS_SUCCESS)
	  {
		APP_DBG_MSG("  Fail   : hci_reset command, result: 0x%x \n", ret);
	  }
	  else
	  {
		APP_DBG_MSG("  Success: hci_reset command\n");
	  }

	  /**
	   * Write the BD Address
	   */
	  p_bd_addr = BleGetBdAddress();
	  ret = aci_hal_write_config_data(CONFIG_DATA_PUBLIC_ADDRESS_OFFSET, CONFIG_DATA_PUBLIC_ADDRESS_LEN, (uint8_t*) p_bd_addr);
	  if (ret != BLE_STATUS_SUCCESS)
	  {
		APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_PUBLIC_ADDRESS_OFFSET, result: 0x%x \n", ret);
	  }
	   else
	   {
		APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_PUBLIC_ADDRESS_OFFSET\n");
		APP_DBG_MSG("  Public Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x\n",p_bd_addr[5],p_bd_addr[4],p_bd_addr[3],p_bd_addr[2],p_bd_addr[1],p_bd_addr[0]);
	   }

	  /**
	   * Write Identity root key used to derive IRK and DHK(Legacy)
	   */
	  ret = aci_hal_write_config_data(CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN, (uint8_t*)a_BLE_CfgIrValue);
	  if (ret != BLE_STATUS_SUCCESS)
	  {
		APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET, result: 0x%x \n", ret);
	  }
	  else
	  {
		APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET\n");
	  }

	  /**
	   * Write Encryption root key used to derive LTK and CSRK
	   */
	  ret = aci_hal_write_config_data(CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN, (uint8_t*)a_BLE_CfgErValue);
	  if (ret != BLE_STATUS_SUCCESS)
	  {
		APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_ER_OFFSET, result: 0x%x \n", ret);
	  }
	  else
	  {
		APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_ER_OFFSET\n");
	  }

	  /**
	   * Set TX Power.
	   */
	  ret = aci_hal_set_tx_power_level(1, CFG_TX_POWER);
	  if (ret != BLE_STATUS_SUCCESS)
	  {
		APP_DBG_MSG("  Fail   : aci_hal_set_tx_power_level command, result: 0x%x \n", ret);
	  }
	  else
	  {
		APP_DBG_MSG("  Success: aci_hal_set_tx_power_level command\n");
	  }

	  /**
	   * Initialize GATT interface
	   */
	  ret = aci_gatt_init();
	  if (ret != BLE_STATUS_SUCCESS)
	  {
		APP_DBG_MSG("  Fail   : aci_gatt_init command, result: 0x%x \n", ret);
	  }
	  else
	  {
		APP_DBG_MSG("  Success: aci_gatt_init command\n");
	  }

	  /**
	   * Initialize GAP interface
	   */
	  role = 0;

	#if (BLE_CFG_PERIPHERAL == 1)
	  role |= GAP_PERIPHERAL_ROLE;
	#endif /* BLE_CFG_PERIPHERAL == 1 */

	#if (BLE_CFG_CENTRAL == 1)
	  role |= GAP_CENTRAL_ROLE;
	#endif /* BLE_CFG_CENTRAL == 1 */

	/* USER CODE BEGIN Role_Mngt*/

	/* USER CODE END Role_Mngt */

	  if (role > 0)
	  {
		const char *name = "StmCLI";

		ret = aci_gap_init(role,
						   CFG_PRIVACY,
						   APPBLE_GAP_DEVICE_NAME_LENGTH,
						   &gap_service_handle,
						   &gap_dev_name_char_handle,
						   &gap_appearance_char_handle);

		if (ret != BLE_STATUS_SUCCESS)
		{
		  APP_DBG_MSG("  Fail   : aci_gap_init command, result: 0x%x \n", ret);
		}
		else
		{
		  APP_DBG_MSG("  Success: aci_gap_init command\n");
		}

		ret = aci_gatt_update_char_value(gap_service_handle, gap_dev_name_char_handle, 0, strlen(name), (uint8_t *) name);
		if (ret != BLE_STATUS_SUCCESS)
		{
		  BLE_DBG_SVCCTL_MSG("  Fail   : aci_gatt_update_char_value - Device Name\n");
		}
		else
		{
		  BLE_DBG_SVCCTL_MSG("  Success: aci_gatt_update_char_value - Device Name\n");
		}
	  }

	  ret = aci_gatt_update_char_value(gap_service_handle,
									   gap_appearance_char_handle,
									   0,
									   2,
									   (uint8_t *)&a_appearance);
	  if (ret != BLE_STATUS_SUCCESS)
	  {
		BLE_DBG_SVCCTL_MSG("  Fail   : aci_gatt_update_char_value - Appearance\n");
	  }
	  else
	  {
		BLE_DBG_SVCCTL_MSG("  Success: aci_gatt_update_char_value - Appearance\n");
	  }

	  /**
	   * Initialize IO capability
	   */
	  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.ioCapability = CFG_IO_CAPABILITY;
	  ret = aci_gap_set_io_capability(BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.ioCapability);
	  if (ret != BLE_STATUS_SUCCESS)
	  {
		APP_DBG_MSG("  Fail   : aci_gap_set_io_capability command, result: 0x%x \n", ret);
	  }
	  else
	  {
		APP_DBG_MSG("  Success: aci_gap_set_io_capability command\n");
	  }

	  /**
	   * Initialize authentication
	   */
	  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.mitm_mode = CFG_MITM_PROTECTION;
	  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMin = CFG_ENCRYPTION_KEY_SIZE_MIN;
	  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMax = CFG_ENCRYPTION_KEY_SIZE_MAX;
	  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode = CFG_BONDING_MODE;

	  ret = aci_gap_set_authentication_requirement(BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode,
												   BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.mitm_mode,
												   CFG_SC_SUPPORT,
												   CFG_KEYPRESS_NOTIFICATION_SUPPORT,
												   BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMin,
												   BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMax,
												   USE_FIXED_PIN_FOR_PAIRING_FORBIDDEN, /* deprecated feature */
												   0,                                   /* deprecated feature */
												   CFG_IDENTITY_ADDRESS);
	  if (ret != BLE_STATUS_SUCCESS)
	  {
		APP_DBG_MSG("  Fail   : aci_gap_set_authentication_requirement command, result: 0x%x \n", ret);
	  }
	  else
	  {
		APP_DBG_MSG("  Success: aci_gap_set_authentication_requirement command\n");
	  }

	  /**
	   * Initialize whitelist
	   */
	  if (BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode)
	  {
		ret = aci_gap_configure_whitelist();
		if (ret != BLE_STATUS_SUCCESS)
		{
		  APP_DBG_MSG("  Fail   : aci_gap_configure_whitelist command, result: 0x%x \n", ret);
		}
		else
		{
		  APP_DBG_MSG("  Success: aci_gap_configure_whitelist command\n");
		}
	  }
	  APP_DBG_MSG("==>> End Ble_Hci_Gap_Gatt_Init function\n\r");
	}

	static void Scan_Request(void)
	{
	  /* USER CODE BEGIN Scan_Request_1 */

	  /* USER CODE END Scan_Request_1 */
	  tBleStatus result;
	  if (BleApplicationContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
	  {
		/* USER CODE BEGIN APP_BLE_CONNECTED_CLIENT */

		/* USER CODE END APP_BLE_CONNECTED_CLIENT */
		result = aci_gap_start_general_discovery_proc(SCAN_P, SCAN_L, CFG_BLE_ADDRESS_TYPE, 0); //by putting it to 0 we ask for more information
		if (result == BLE_STATUS_SUCCESS)
		{
		/* USER CODE BEGIN BLE_SCAN_SUCCESS */

		/* USER CODE END BLE_SCAN_SUCCESS */
		  APP_DBG_MSG(" \r\n\r** START GENERAL DISCOVERY (SCAN) **  \r\n\r");
		}
		else
		{
		/* USER CODE BEGIN BLE_SCAN_FAILED */

		/* USER CODE END BLE_SCAN_FAILED */
		  APP_DBG_MSG("-- BLE_App_Start_Limited_Disc_Req, Failed \r\n\r");
		}
	  }
	  /* USER CODE BEGIN Scan_Request_2 */

	  /* USER CODE END Scan_Request_2 */
	  return;
	}

	static void Connect_Request(void)
	{
	  /* USER CODE BEGIN Connect_Request_1 */

	  /* USER CODE END Connect_Request_1 */
	  tBleStatus result;

	  APP_DBG_MSG("\r\n\r** CREATE CONNECTION TO SERVER **  \r\n\r");

	  if (BleApplicationContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
	  {
		result = aci_gap_create_connection(SCAN_P,
										   SCAN_L,
										   SERVER_REMOTE_ADDR_TYPE, SERVER_REMOTE_BDADDR,
										   CFG_BLE_ADDRESS_TYPE,
										   CONN_P1,
										   CONN_P2,
										   0,
										   SUPERV_TIMEOUT,
										   CONN_L1,
										   CONN_L2);

		if (result == BLE_STATUS_SUCCESS)
		{
		  /* USER CODE BEGIN BLE_CONNECT_SUCCESS */

		  /* USER CODE END BLE_CONNECT_SUCCESS */
		  BleApplicationContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;

