KAVATER/STM32-BLE/STM_Client/STM32_WPAN/App/app_ble.c
		}
		else
		{
		  /* USER CODE BEGIN BLE_CONNECT_FAILED */

		  /* USER CODE END BLE_CONNECT_FAILED */
		  BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;

		}
	  }
	  /* USER CODE BEGIN Connect_Request_2 */

	  /* USER CODE END Connect_Request_2 */
	  return;
	}

	static void Switch_OFF_GPIO()
	{
	  /* USER CODE BEGIN Switch_OFF_GPIO */

	  /* USER CODE END Switch_OFF_GPIO */
	}

	const uint8_t* BleGetBdAddress(void)
	{
	  uint8_t *p_otp_addr;
	  const uint8_t *p_bd_addr;
	  uint32_t udn;
	  uint32_t company_id;
	  uint32_t device_id;

	  udn = LL_FLASH_GetUDN();

	  if (udn != 0xFFFFFFFF)
	  {
		company_id = LL_FLASH_GetSTCompanyID();
		device_id = LL_FLASH_GetDeviceID();

		/**
		 * Public Address with the ST company ID
		 * bit[47:24] : 24bits (OUI) equal to the company ID
		 * bit[23:16] : Device ID.
		 * bit[15:0] : The last 16bits from the UDN
		 * Note: In order to use the Public Address in a final product, a dedicated
		 * 24bits company ID (OUI) shall be bought.
		 */
		a_BdAddrUdn[0] = (uint8_t)(udn & 0x000000FF);
		a_BdAddrUdn[1] = (uint8_t)((udn & 0x0000FF00) >> 8);
		a_BdAddrUdn[2] = (uint8_t)device_id;
		a_BdAddrUdn[3] = (uint8_t)(company_id & 0x000000FF);
		a_BdAddrUdn[4] = (uint8_t)((company_id & 0x0000FF00) >> 8);
		a_BdAddrUdn[5] = (uint8_t)((company_id & 0x00FF0000) >> 16);

		p_bd_addr = (const uint8_t *)a_BdAddrUdn;
	  }
	  else
	  {
		p_otp_addr = OTP_Read(0);
		if (p_otp_addr)
		{
		  p_bd_addr = ((OTP_ID0_t*)p_otp_addr)->bd_address;
		}
		else
		{
		  p_bd_addr = a_MBdAddr;
		}
	  }

	  return p_bd_addr;
	}

	/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */

	/* USER CODE END FD_LOCAL_FUNCTIONS */

	/*************************************************************
	 *
	 * WRAP FUNCTIONS
	 *
	 *************************************************************/
	void hci_notify_asynch_evt(void* pdata)
	{
	  UTIL_SEQ_SetTask(1 << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SCH_PRIO_0);
	  return;
	}

	void hci_cmd_resp_release(uint32_t flag)
	{
	  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);
	  return;
	}

	void hci_cmd_resp_wait(uint32_t timeout)
	{
	  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);
	  return;
	}

	static void BLE_UserEvtRx(void * pPayload)
	{
	  SVCCTL_UserEvtFlowStatus_t svctl_return_status;
	  tHCI_UserEvtRxParam *pParam;

	  pParam = (tHCI_UserEvtRxParam *)pPayload;

	  svctl_return_status = SVCCTL_UserEvtRx((void *)&(pParam->pckt->evtserial));
	  if (svctl_return_status != SVCCTL_UserEvtFlowDisable)
	  {
		pParam->status = HCI_TL_UserEventFlow_Enable;
	  }
	  else
	  {
		pParam->status = HCI_TL_UserEventFlow_Disable;
	  }

	  return;
	}

	static void BLE_StatusNot(HCI_TL_CmdStatus_t status)
	{
	  uint32_t task_id_list;
	  switch (status)
	  {
		case HCI_TL_CmdBusy:
		  /**
		   * All tasks that may send an aci/hci commands shall be listed here
		   * This is to prevent a new command is sent while one is already pending
		   */
		  task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
		  UTIL_SEQ_PauseTask(task_id_list);
		  break;

		case HCI_TL_CmdAvailable:
		  /**
		   * All tasks that may send an aci/hci commands shall be listed here
		   * This is to prevent a new command is sent while one is already pending
		   */
		  task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
		  UTIL_SEQ_ResumeTask(task_id_list);
		  break;

		default:
		  break;
	  }
	  return;
	}

	void SVCCTL_ResumeUserEventFlow(void)
	{
	  hci_resume_flow();
	  return;
	}

	/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

	/* USER CODE END FD_WRAP_FUNCTIONS */
